---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.LevelAssociationFailures
source: html/3f214253-850a-b838-3bd5-2715056a4749.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LevelAssociationFailures

Failures about Level association of Analytical Node.

## Syntax (C#)
```csharp
public static class LevelAssociationFailures
```